// ИТ продавница 2 Problem 1 (0 / 0)


// Во програмскиот јазик C да се креира структура Laptop за опишување на спецификациите на даден преносен компјутер.
// Структурата треба да содржи: (5 поени)

// Марка ( низа од 100 знаци)
// Големина на хард диск (цел број)
// Големина на RAM (цел број)
// Дали хард дискот е SSD (булова променлива)


// Да се креира структура ITStore, што содржи: (5 поени)

// Име на продавницата (низа од 100 знаци)
// Локација (низа од 100 знаци)
// Низа од достапни лаптопи (низа од максимум 100 елементи од структурата Laptop)
// Број на елементи во низата (цел број)

// Да се креира функција print за печатење на информациите за сите лаптопи во една продавница
// во формат: (10 поени)

// [Ime na prodavnicata] [Lokacija]
// [Marka1] [golemina na hard disk] [golemina na RAM]
// [Marka2] [golemina na hard disk] [golemina na RAM]
// [Marka3] [golemina na hard disk] [golemina na RAM]
// ...
// Да се креира функција najdobra_memorija, која што прима променлива од тип ITStore
// како влезен параметар и го враќа бројот на лапопи кои имаат RAM >= на 8GB и имаат
// SSD за хард диск. (7 поени)

// Да се креира функција najdobra_ponuda, што прима низа од променливи од типот ITStore
// и го печати името и локацијата на онаа продавница која нуди најголем број преносни
// компјутери со најдобра меморија. Ако има повеќе такви продавници, се печати последно
// најдената (8 поени)

// Да се дополни функцијата main (10 поени).

// Од тастатура се внесува бројот на продавници, па потоа за секоја продавница се внесуваат
// името и локацијата, а потоа бројот на компјутери, па за секој од компјутерите марка,
// големина на хард дискг, големина на RAM, дали е SSD. Потоа се печатат сите внесени
// продавници и најдобрата понуда.